/* Main alert text */
"Q_HEADLINE_APP" = "”%@” on %@%@. Haluatko varmasti avata sen?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below). Example: “[GigaFun]” is [an application] [attached to a mail message]. Are you sure you want to open it? */
"Q_HEADLINE_APP_THAT_WAS" = "”%@” on %@, joka oli %@. Haluatko varmasti avata sen?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below). Example: “[GigaFun]” is [an application] that was [attached to a mail message]. Are you sure you want to open it? */
"Q_HEADLINE_DOC_BINDING" = "”%@” voi olla %@. Se oli %@ ja sen avaa %@. Haluatko varmasti avata sen?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below), app name. Example: “[Fun.html]” may be [an application]. It was [attached to a mail message] and will be opened by [GigaFun]. Are you sure you want to open it?*/
"Q_HEADLINE_MALWARE" = "”%@” vahingoittaa tietokonettasi. Siirrä se roskakoriin."; /* file name. Example:  “[GigaFun]” will damage your computer. You should move it to the Trash. */

/* Origin phrases for the headline */
/* These phrases complete the sentence "This file was..." */
"Q_ORIGIN_INTERNET" = ", joka on ladattu internetistä"; 
"Q_ORIGIN_WEB" = ", joka on ladattu internetistä";
"Q_ORIGIN_MAIL" = "liitetty sähköpostiviestiin";
"Q_ORIGIN_CHAT" = "liitetty keskusteluviestiin";
"Q_ORIGIN_CALENDAR" = "liitetty kalenteritapahtumaan";
"Q_ORIGIN_MESSAGE" = "liitetty viestiin";

/* Detail text for malware */
"Q_DETAIL_MALWARE_NAME" = "Se sisältää haittaohjelman ”%@”."; /* malware signature name */
"Q_HEADLINE_MALWARE_MOVE_ERROR" = "Kohdetta ”%@” ei voitu siirtää roskakoriin."; /* name */
"Q_HEADLINE_MALWARE_EJECT_ERROR" = "Levytiedostoa, joka sisältää kohteen ”%@”, ei voitu poistaa näkyvistä."; /* name */
"Q_DETAIL_MALWARE_REMOVE_ERROR" = "Tämä haittaohjelma on poistettava käsin.";

/* Detail text for files */
"Q_DETAIL_DOWNLOAD_DATE" = "Tämä %@ ladattiin %@."; /* "file" or "alias", date phrase */
"Q_DETAIL_DOWNLOAD_AGENT_DATE" = "%@ latasi tämän %@latauksen %@."; /* application name, "file" or "alias", date phrase */
"Q_DETAIL_DOWNLOAD_AGENT_DATE_FROM" = "%@ latasi tämän %@latauksen %@ sijainnista %@."; /* application name, "file" or "alias", date phrase, Internet domain name */
"Q_DETAIL_RECEIVED_AGENT_DATE" = "%@ vastaanotti tämän %@n %@."; /* application name, "file" or "alias", date phrase */
"Q_DETAIL_TYPE_FILE" = "tiedosto";
"Q_DETAIL_TYPE_ALIAS" = "alias";

/* Detail text for disk images */
"Q_DETAIL_ON_DMG" = "”%@” on levytiedostolla ”%@”."; /* filename, filename */
"Q_DETAIL_ON_DMG_UNKNOWN" = "”%@” on levytiedostolla, jota ei löytynyt."; /* filename */
"Q_DETAIL_DMG_DOWNLOAD_DATE" = "Levytiedosto ladattiin %@."; /* date phrase */
"Q_DETAIL_DMG_DOWNLOAD_AGENT_DATE" = "%@ latasi tämän levytiedoston %@."; /* application name, date phrase */
"Q_DETAIL_DMG_DOWNLOAD_AGENT_DATE_FROM" = "%@ latasi tämän levytiedoston %@ sijainnista %@."; /* application name, date phrase, Internet domain name */
"Q_DETAIL_DMG_RECEIVED_AGENT_DATE" = "%@ vastaanotti tämän levytiedoston %@."; /* application name, date phrase */

/* Detail text for network file systems */
"Q_DETAIL_ON_SERVER" = "”%@” on verkkotaltiolla."; /* filename */
"Q_DETAIL_ON_SERVER_NAME" = "”%@” on verkkotaltiolla ”%@”."; /* filename, volume name */
"Q_DETAIL_SERVER_AGENT_DATE" = "%@ avasi verkkoyhteyden %@."; /* application name, date phrase */

/* Date/time phrases used in detail text */
"Q_DATE_TODAY" = "tänään %@"; /* time */
"Q_DATE_YESTERDAY" = "eilen %@"; /* time */
"Q_DATE_THIS_YEAR" = "%@"; /* date */
"Q_DATE_FULL" = "%@"; /* date */
"Q_DATE_UNKNOWN" = "tuntemattomana ajankohtana"; /* inserted into the date/time phrase slot when a date is not known (very rare) */

/* Checkbox titles */
"Q_DO_NOT_WARN" = "Älä varoita avattaessa tätä ohjelmaa"; /* (unused) */
"Q_DO_NOT_WARN_DMG" = "Älä varoita avattaessa tällä levytiedostolla olevia ohjelmia";
"Q_DO_NOT_WARN_SERVER" = "Älä varoita avattaessa tällä verkkotaltiolla olevia ohjelmia";

/* Regular button titles */
"Q_BUTTON_OPEN" = "Avaa";
"Q_BUTTON_CANCEL" = "Kumoa";
"Q_BUTTON_SHOW_WEB_PAGE" = "Näytä verkkosivu";
"Q_BUTTON_SHOW_MAIL" = "Näytä viesti";
"Q_BUTTON_SHOW_CHAT" = "Näytä viesti";
"Q_BUTTON_SHOW_CALENDAR" = "Näytä tapahtuma";
"Q_BUTTON_SHOW_DMG" = "Näytä levytiedosto";
"Q_BUTTON_SHOW_APP" = "Näytä ohjelma";
"Q_BUTTON_SHOW_SOURCE" = "Näytä lähde";
"Q_BUTTON_EJECT_DMG" = "Poista levytiedosto näkyvistä";

/* Malware button titles */
"Q_BUTTON_MOVE_TO_TRASH" = "Siirrä roskakoriin";

/* File kinds */
"Q_TYPE_APPLICATION" = "ohjelma";
"Q_TYPE_SCRIPT_APPLICATION" = "skriptiohjelma";
"Q_TYPE_UNIX_APPLICATION" = "UNIX-ohjelma";
"Q_TYPE_JAVA_APPLICATION" = "Java-ohjelma";
"Q_TYPE_WEB_APPLICATION" = "verkkosovellus";
"Q_TYPE_QUARTZ_APPLICATION" = "Quartz Composer -ohjelma";
"Q_TYPE_WINDOWS_APPLICATION" = "Windows-ohjelma";
"Q_TYPE_ALIAS_VARIANT" = "%@ alias"; /* application type, e.g. "a Unix application alias" */

/* Help */
"Q_HELP_ANCHOR" = "mh11389";
"Q_HELP_MALWARE_ANCHOR" = "mh27449";
